## Plan Result (468: prod - PlanAndApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 4 to destroy.</code></pre>

* Replace
  * module.pcol.sendgrid_domain_authentication.domain-authenticate[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record1[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record2[&#34;hmcts.net&#34;]
  * module.pcol-dns.azurerm_dns_cname_record.record3[&#34;hmcts.net&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcol.sendgrid_domain_authentication.domain-authenticate["hmcts.net"] must be replaced
-/+ resource "sendgrid_domain_authentication" "domain-authenticate" {
      + custom_dkim_selector = "prd" # forces replacement
      - custom_spf           = false -> null
      ~ dns                  = [
          - {
              - data  = "prd.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "prd2.domainkey.u33702743.wl244.sendgrid.net"
              - host  = "prd2._domainkey.hmcts.net"
              - type  = "cname"
              - valid = false
            },
          - {
              - data  = "u33702743.wl244.sendgrid.net"
              - host  = "em4727.hmcts.net"
              - type  = "cname"
              - valid = false
            },
        ] -> (known after apply)
      ~ id                   = "21562793" -> (known after apply)
      ~ ips                  = [] -> (known after apply)
      ~ subdomain            = "em4727" -> (known after apply)
      ~ username             = "hmcts-pcol-prod" -> (known after apply)
      ~ valid                = false -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record1["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record1" {
      ~ fqdn                = "prd._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd._domainkey" -> (known after apply)
      ~ name                = "prd._domainkey" -> (known after apply) # forces replacement
      ~ record              = "prd.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record2["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record2" {
      ~ fqdn                = "prd2._domainkey.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/prd2._domainkey" -> (known after apply)
      ~ name                = "prd2._domainkey" -> (known after apply) # forces replacement
      ~ record              = "prd2.domainkey.u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

  # module.pcol-dns.azurerm_dns_cname_record.record3["hmcts.net"] must be replaced
-/+ resource "azurerm_dns_cname_record" "record3" {
      ~ fqdn                = "em4727.hmcts.net." -> (known after apply)
      ~ id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/hmcts.net/CNAME/em4727" -> (known after apply)
      ~ name                = "em4727" -> (known after apply) # forces replacement
      ~ record              = "u33702743.wl244.sendgrid.net" -> (known after apply)
      - tags                = {} -> null
        # (4 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":77,"Program":"tfcmt","SHA1":"","Target":"468: prod - PlanAndApply","Vars":{}} -->